{
    "29205": {
        "thread_id": 29205,
        "title": "Steven Bonnell II / Destiny / Destiny.gg | Kiwi Farms",
        "timestamp": 1489686662,
        "messages": [
            {
                "user_name": "Assorted Nuts",
                "user_id": "3296",
                "content": "Destiny himself joins starting here. https://kiwifarms.net/threads/steven-bonnell-ii-destiny-destiny-gg.29205/page-66#post-3312395\n\nIf you've been following the drama with Jontron you probably know he had a debate with this guy called Destiny. Many people took note of his exceptional behavior and wondered if he should have his own thread. So here we are, because this guy is nuttier than I thought.\n\nOn the surface Destiny might seem like any other Twitch streamer. There's nothing particularly noteworthy about his gameplay far as I can tell. What IS noteworthy are his debates with other people and how he acts during them. The guy is the definition of what some people call the Gish Gallop. He fires off tons of information at rapid speed to drown out his opponent. But when he gets on the ropes the guy chimps out like crazy.\n\nHis debate with Mister Metokur is probably the best example of his behavior. If you can even stomach the 'tism for very long you'll see what I mean about his debate style. At the very least I recommend you watch the bit at one hour and twenty seven minutes where he loses his shit at the idea that people can make decisions. Really.\n\n\n\n\n\nDestiny is also completely unable to take criticism. He constantly DMCAs clips showing how fucking stupid he is. This has most recently gotten him into a spat with Sargon of Akkad who had pulled some particularly ridiculous claims from the Jontron debate.\n\n\n\n\n\nThere are also reports that an angry girlfriend got a hold of his Twitter account and posted pictures of his dick once. I haven't been able to find the pictures, but I did find that some of his fans posted their own dickpics in solidarity with him. Just lovely.\nhttps://archive.is/Ne9qK\n\nA leaked chatlog also shows that he was flirting with a fifteen year old girl and may have also fucked her. So there's that.\nEDIT: If what @FartingRetard says is to be believed it was just a picture of her in a bikini. Still creepy as fuck.\nhttps://archive.is/ssxNx\n\n\nHe also supports incest. I'm still trying to find the exact video, but there are clips of it at the beginning of the last video in this post. If anyone can find the original I'll add it to the OP.\n\nNaked Ape also just put out a video which highlights many of these examples of Destiny's behavior and more. (It was also easy for me to pillage archive links from.)\n\n\n\n\n\nWebsite: http://www.destiny.gg/\nYoutube: https://www.youtube.com/user/destiny\nTwitter: https://twitter.com/OmniDestiny\nReddit Account: https://www.reddit.com/user/NeoDestiny\nSub-Reddit: https://www.reddit.com/r/Destiny/",
                "timestamp": "2017-03-16T13:51:02-0400"
            },
            {
                "user_name": "Sergeant Politeness",
                "user_id": "13517",
                "content": "Awful personality, chimps out like crazy, DMCAs, defends incest, fucks a kid—are we sure this isn't a horrorcow instead?",
                "timestamp": "2017-03-16T14:29:04-0400"
            },
            {
                "user_name": "Yellow Yam Scam",
                "user_id": "6250",
                "content": "KiA please go",
                "timestamp": "2017-03-16T14:31:44-0400"
            },
            {
                "user_name": "Unknown",
                "user_id": "Unknown",
                "content": "I mean, incest isn't always a bad thing",
                "timestamp": "2017-03-16T14:38:21-0400"
            },
            {
                "user_name": "CatParty",
                "user_id": "25",
                "content": "more importantly",
                "timestamp": "2017-03-16T14:43:06-0400"
            },
            {
                "user_name": "Dandelo",
                "user_id": "9900",
                "content": "i remember he made fun of someone for having a 9 to 5 job.",
                "timestamp": "2017-03-16T14:43:57-0400"
            },
            {
                "user_name": "Kudgel",
                "user_id": "14350",
                "content": "At least he's honest.",
                "timestamp": "2017-03-16T14:53:22-0400"
            },
            {
                "user_name": "Takayuki Yagami",
                "user_id": "1586",
                "content": "Yellow Yam Scam said:\n\n\n\n\t\t\tKiA please go\n\t\t\nClick to expand...\n\nThey may be getting brigaded by his fans. Jon came off as a retard during that \"debate\", but damn if this fuck isn't nuts in his own right.",
                "timestamp": "2017-03-16T14:56:24-0400"
            },
            {
                "user_name": "LillyTheBestGirl",
                "user_id": "10855",
                "content": "That \"Steven the Second\" is so cringy.",
                "timestamp": "2017-03-16T14:57:29-0400"
            },
            {
                "user_name": "unclestryker",
                "user_id": "7519",
                "content": "Steve is live right now bitching about KIA.\nhttps://www.destiny.gg/bigscreen?from=reddit#thumb\n\n\n \nhttps://www.reddit.com/r/Destiny/comments/5zrt6z/looking_for_a_new_youtube_manager_1kmonth_salary/",
                "timestamp": "2017-03-16T15:18:44-0400"
            },
            {
                "user_name": "autism420",
                "user_id": "3740",
                "content": "CatParty said:\n\n\n\n\t\t\tmore importantly\n\n\n\n\n\n\n\nClick to expand...\n\n@*Asterisk*",
                "timestamp": "2017-03-16T15:23:40-0400"
            },
            {
                "user_name": "Feline Darkmage",
                "user_id": "9208",
                "content": "Just said on his stream he'll be talking to Sargon tomorrow.\n\nAlso, how many people have been jumping to his defense to claim this is some goobergobbles smear and/or harassment campaign so far?",
                "timestamp": "2017-03-16T15:27:07-0400"
            },
            {
                "user_name": "unclestryker",
                "user_id": "7519",
                "content": "Feline Darkmage said:\n\n\n\n\t\t\tSargon\n\t\t\nClick to expand...\n\n\nCarl (Sargon) of all people, knows better then to debate re.tards.",
                "timestamp": "2017-03-16T15:34:30-0400"
            },
            {
                "user_name": "Poor Choices",
                "user_id": "3634",
                "content": "Steven was so much better when he was raging about how overpowered Terran was instead of political internet bullshit.",
                "timestamp": "2017-03-16T15:43:15-0400"
            },
            {
                "user_name": "IAmNotDavid",
                "user_id": "13443",
                "content": "I remember Destiny back when StarCraft 2 was still relevant. Unfortunately due to his \"depression\" he never did much beyond streaming. Maybe he got picked up by a minor team? Wasn't for long though.\n\nHe used to offer his services as a StarCraft coach and someone even uploaded a few videos of him in a Skype call with a kid.\n\n\n\nSpoiler\n\n\n\nBets on how long it takes until a Kiwi unearths Steve's other pedophilic tendencies.",
                "timestamp": "2017-03-16T16:12:45-0400"
            },
            {
                "user_name": "Tarprome",
                "user_id": "14230",
                "content": ">Be declared winner of the debate by a bunch of journalists.\n>Proceeds to shove his own cock on the mouth and proudly displays to the public.",
                "timestamp": "2017-03-16T16:18:22-0400"
            },
            {
                "user_name": "Assorted Nuts",
                "user_id": "3296",
                "content": "IAmNotDavid said:\n\n\n\n\n\nSpoiler\n\n\n\nBets on how long it takes until a Kiwi unearths Steve's pedophilic tendencies.\n\n\n\n\nClick to expand...\n\nLook at the OP again.\n\n\nPurpleDude said:\n\n\n\n\t\t\tA leaked chatlog also shows that he was flirting with a fifteen year old girl and may have also fucked her. So there's that.\nhttps://archive.is/ssxNx\n\nClick to expand...",
                "timestamp": "2017-03-16T16:30:24-0400"
            },
            {
                "user_name": "MasterDisaster",
                "user_id": "6984",
                "content": "PurpleDude said:\n\n\n\n\t\t\tHis debate with Mister Metokur is probably the best example of his behavior. If you can even stomach the 'tism for very long you'll see what I mean about his debate style. At the very least I recommend you watch the bit at one hour and twenty seven minutes where he loses his shit at the idea that people can make decisions. Really.\n\t\t\nClick to expand...\n\nAs someone who's worked plenty of shitty jobs the one thing I can't stand is when people try to tell me how to improve my life.  Doesn't this fucking idiot understand that you need lower level/entry level jobs in order to function in any business?  Sure the CEO makes a shit ton of money but someone still has to deliver that mail.  Idiots that think everyone can be on the same tier need a nice bitchslap.  As sad as it sounds there's gotta be Gods and Clods in order for shit to work.  Someones gotta pick those tomatoes.  Someones gotta shovel that shit.  It's wanting to rise above those jobs that helps define what you want out of life.",
                "timestamp": "2017-03-16T16:30:59-0400"
            },
            {
                "user_name": "IAmNotDavid",
                "user_id": "13443",
                "content": "PurpleDude said:\n\n\n\n\t\t\tLook at the OP again.\n\t\t\nClick to expand...\n\n\n\n\nSpoiler\n\n\n\nFuck, mobile didn't add the \"additional\". My bad.",
                "timestamp": "2017-03-16T16:48:28-0400"
            },
            {
                "user_name": "NIGGO KILLA",
                "user_id": "14509",
                "content": "Can we focus on that part where Ape claims he was plotting to kill a man? Do we have anymore info on that?",
                "timestamp": "2017-03-16T19:10:23-0400"
            }
        ]
    },
    "10": {
        "thread_id": 10,
        "title": "The General forum rules | Kiwi Farms",
        "timestamp": 1359897061,
        "messages": [
            {
                "user_name": "champthom",
                "user_id": "2",
                "content": "I'm taking a big leap by having a General forum here. But the demand is there so I allow it. A few basic rules though:\n\n1) Keep your sperging to a minimum\n\nIf you like something, that's fine. But don't sperg out and tell us how you obsess over some children's cartoon or you write fanfiction where you rape some TV show character, that sort of thing. For the love of God, if you have any particular sexual fetishes or anything like that, DON'T SHARE THEM WITH US. \n\n2) Be careful about personal information\n\nThis forum sometimes attracts unsavory characters so be careful posting stuff like your real name, where you live and work, contact information tied with your real name, etc. This is for your safety.\n\nIf anything else needs to be addressed, I'll update this post.",
                "timestamp": "2013-02-03T08:11:01-0500"
            },
            {
                "user_name": "Niachu",
                "user_id": "39",
                "content": "champthom said:\n\t\t\t\n\t\t\n\n\n\t\t\t1) Keep your sperging to a minimum\n\nIf you like something, that's fine. But don't sperg out and tell us how you obsess over some children's cartoon or you write fanfiction where you rape some TV show character, that sort of thing. For the love of God, if you have any particular sexual fetishes or anything like that, DON'T SHARE THEM WITH US.\n\t\t\nClick to expand...\n\n\nI've been noticing a trend where people are being a little more...open about their preferences.\n\nGuys, it's cool that you feel comfortable enough to share things here, but on the whole try to keep it clean. If you wanna discuss your orientation and the like, cool, whatever helps you relate to each other, but  the things you find fap worthy do not need to be discussed. Not everyone likes to read that so be considerate. I don't think it will, but I'm gonna be watchdoggin' if it gets out of hand.",
                "timestamp": "2013-02-27T10:11:22-0500"
            },
            {
                "user_name": "NiggerDeathRay",
                "user_id": "184622",
                "content": "It's funny how despite being 12 years old these rules still hold up.\nApologies for the negrobump doe",
                "timestamp": "2025-01-17T18:45:51-0500"
            }
        ]
    },
    "6": {
        "thread_id": 6,
        "title": "The Universal Rules | Kiwi Farms",
        "timestamp": 1359895771,
        "messages": [
            {
                "user_name": "champthom",
                "user_id": "2",
                "content": "This is a rule that applies to every forum here. I shouldn't really need to spell it out but I want to make it clear. It's:\n\n1) Respect one another and be civil.\n\nYou might not agree with everyone all the time, someone might rub you the wrong way, doesn't mean you need to be a dick about it. If they're bothering you, bring it up to a mod or admin. \n\nDon't call people names, don't libel people, that sort of shit. It's common sense really but I think I should spell it out. I think I also need to spell it out here because we sometimes attract would be trolls. This isn't 4chan or /cwc/, I won't tolerate people calling other people \"fags\" or other shit that might fly on a board like /b/. \n\n2) Save the drama for your mama\n\nDon't start drama and shit on here, we don't need it. If you get personally involved with another forum, and shit is happening between you and them, don't bring it onto the forum. We should all be adults here, we don't need childish shit like that going on.\n\nThat's about all I can think of for now and if I come up with other universal rules, I will update this thread.",
                "timestamp": "2013-02-03T07:49:31-0500"
            }
        ]
    },
    "1": {
        "thread_id": 1,
        "title": "Welcome to the new Permanent CWCki Forums | Kiwi Farms",
        "timestamp": 1359531580,
        "messages": [
            {
                "user_name": "Null",
                "user_id": "1",
                "content": "Hey all,\n\nThis community, that I've only recently come across, is the most mature and civil group of people that isn't outright banal. You guys are a constant source of intellectual amusement, with each of you coming to every conversation with a unique point of view and theory. It's for that reason I've volunteered to support the forum with an true and honest domain name and an actual host that isn't going to trash our happy home just because of whom it is centered around.\n\nHere's what the change means:\n\nThe forums are now running on a pure form of the PHPBB3 software suite, so I can change anything. I'm a programmer by employment and by hobby, so anything we may need tweaked or installed to suit our needs can be done.\nDreamhost is now the provider of hosting services, and they will not chop down our Internet unless we violate International or United States law.\nAll settings, users, and posts in the previous forum(s) have been lost forever. Sorry.\n\nChampthom is the Super Administrator and the Community Manager. He has complete control over the content of the forum and its users. I've given him the task of setting up the boards and promoting the right people into Administrative and Moderator roles, and also ensuring that Hulk Hogan be given his proper yellow title (as he is a True American).\n\n\n\n\t\t\t\n\t\t\t\tchampthom said:\n\t\t\t\n\t\t\n\n\n\t\t\tFor the record, anyone who was banned that I remember WILL be banned on sight here.\n\t\t\nClick to expand...\n\n\n\nI've said my piece and I will be stepping back from this point. I do not wish to become the Supreme Glorious Leader of the board and its users, and I'd like to see the current administration continue on in their role. I will not be participating in community management, merely maintaining the boards and making sure that everyone gets a chance to discuss Chris without worry of another shut down. I like you guys, and I want to see this group carry on for a long time.\n\nFeel free to use this thread to celebrate, make software requests, or do whatever.",
                "timestamp": "2013-01-30T02:39:40-0500"
            },
            {
                "user_name": "Unknown",
                "user_id": "Unknown",
                "content": "Null said:\n\t\t\t\n\t\t\n\n\n\t\t\tensuring that Hulk Hogan be given his proper yellow title (as he is a True American).\n\t\t\nClick to expand...\n\n\nThis is the top priority.\n\nThank you, Null. You are a True and Honest American as well.",
                "timestamp": "2013-01-31T17:15:17-0500"
            },
            {
                "user_name": "Dunsparce",
                "user_id": "6",
                "content": "Sonichu Mod Dunsparce, reporting for duty.",
                "timestamp": "2013-01-31T17:16:52-0500"
            },
            {
                "user_name": "champthom",
                "user_id": "2",
                "content": "For the record, anyone who was banned that I remember WILL be banned on sight here. These include (but not limited to):\n\n-jcrowley\n-Slimz\n-KEngel\n-PDK\n-Anthrillca/A-Log\n-Ofos\n-the people involved in the recent drama (Chit, Blue, etc.)\n\nIf the staff sees you and remembers you were banned, then you WILL be banned. Otherwise, if you're a jackoff who I or the rest of the staff don't remember and you keep your nose clean, you can stay here.",
                "timestamp": "2013-02-01T06:50:37-0500"
            },
            {
                "user_name": "Unknown",
                "user_id": "Unknown",
                "content": "In regards to that, props to Rusty for not ever ban evading (unlike just about everyone else).",
                "timestamp": "2013-02-02T21:08:38-0500"
            },
            {
                "user_name": "darkhorse816",
                "user_id": "9",
                "content": "Hey guys! It's great to be here on the new forum.\n\nHopefully there won't be any more drama. For a while, it was like high school all over again.",
                "timestamp": "2013-02-03T08:46:04-0500"
            },
            {
                "user_name": "J09506",
                "user_id": "11",
                "content": "Feels like....Home.",
                "timestamp": "2013-02-03T08:48:14-0500"
            },
            {
                "user_name": "José Mourinho",
                "user_id": "8",
                "content": "Great to see the new permanent forum.",
                "timestamp": "2013-02-03T08:52:22-0500"
            },
            {
                "user_name": "darkhorse816",
                "user_id": "9",
                "content": "Compy, is your avatar Peter from The Room?\n\nThe suspense is killing me. I feel like I'm sitting on an atomic bomb, waiting for it to explode.",
                "timestamp": "2013-02-03T08:58:43-0500"
            },
            {
                "user_name": "The Hunter",
                "user_id": "14",
                "content": "That's nice. Now gimmie mod.",
                "timestamp": "2013-02-03T09:02:29-0500"
            },
            {
                "user_name": "José Mourinho",
                "user_id": "8",
                "content": "darkhorse816 said:\n\t\t\t\n\t\t\n\n\n\t\t\tCompy, is your avatar Peter from The Room?\n\nThe suspense is killing me. I feel like I'm sitting on an atomic bomb, waiting for it to explode.\n\t\t\nClick to expand...\n\n\nOh hi darkhorse816.",
                "timestamp": "2013-02-03T09:32:33-0500"
            },
            {
                "user_name": "darkhorse816",
                "user_id": "9",
                "content": "Alan Pardew said:\n\t\t\t\n\t\t\n\n\n\t\t\tOh hi darkhorse816. \n\nClick to expand...\n\n\nLet's go eat, huh?",
                "timestamp": "2013-02-03T09:46:10-0500"
            },
            {
                "user_name": "Stratochu",
                "user_id": "22",
                "content": "Oh hai folks. Stratowhammy has arrived.\n\nIf Chris-chan himself registers, will he be banned? Just curious.",
                "timestamp": "2013-02-03T10:01:25-0500"
            },
            {
                "user_name": "KatsuKitty",
                "user_id": "23",
                "content": "I'm back, sweeties.",
                "timestamp": "2013-02-03T10:30:10-0500"
            },
            {
                "user_name": "pinkyucat",
                "user_id": "26",
                "content": "Hi! I'm pinkyucat! I have been reading the CWCki for a while and I finally decided to register for these forums starting with the last one, I hope these really are permanent this time. I would have joined sooner, but all the other times I tried it said the forums were removed and redirected me to a hip-hop website.",
                "timestamp": "2013-02-03T11:11:30-0500"
            },
            {
                "user_name": "Ace_Reloaded",
                "user_id": "30",
                "content": "Hooray, we're permanent again! I wasn't active much on the temp boards because they kept getting moved. This is awesome. Just have to go find a new avatar now.",
                "timestamp": "2013-02-03T11:25:56-0500"
            },
            {
                "user_name": "The Hunter",
                "user_id": "14",
                "content": "Ace_Reloaded said:\n\t\t\t\n\t\t\n\n\n\t\t\tHooray, we're permanent again! I wasn't active much on the temp boards because they kept getting moved. This is awesome. Just have to go find a new avatar now.\n\t\t\nClick to expand...\n\nYep. No more, \"MY ACCOUNT GOT DELETED 4 NO RESON CURSE U CWCKI FROUMS,\" ever again.\n\nEDIT: Also, the search function works here. Today's a momentous day for the CWCki forums.",
                "timestamp": "2013-02-03T11:27:42-0500"
            },
            {
                "user_name": "He Sets Me On Fire",
                "user_id": "44",
                "content": "Thanks, Null!  Good to be back on solid ground.",
                "timestamp": "2013-02-03T13:26:11-0500"
            },
            {
                "user_name": "Tubular Monkey",
                "user_id": "45",
                "content": "It's good to have a permanent home again!  Thanks to everyone involved.",
                "timestamp": "2013-02-03T13:50:14-0500"
            },
            {
                "user_name": "snowkitten91",
                "user_id": "50",
                "content": "Snowkitten91 here! I'm glad that we have finally found a stable home.",
                "timestamp": "2013-02-03T14:09:57-0500"
            }
        ]
    }
}